#include<stdio.h>

int main()
{
	int a = 5%2;//  5\2指整数部分  取商         5%2指余数 取模
	printf("%d\n", a);
	return 0;
}

int main()
{
	//移（二进制）位操作字符
	//  << 左移
	//  >> 右移
	int a = 3;
	//整型1占四个字节--三十二个bite位
	//0000000000000000000000000000001 == a
	int b = a << 1;
	printf("%d\n", b);
	return 0;
}


int main()
{
	//  （二进制）位操作  
	//  & 按位与   对应位同时为1时取1，否则取0
	//  |按位或    对应位有一个1时即可取1，同时为0取0
	//  ^按位异或  对应位相异取1，相同取0
	int a = 3;//011
	int b = 5;//101
	int c = a^b;
	printf("%d\n", c);
	return 0;
}



/*a = 20;     = 赋值   ==判断相等
a=a+10 等价于 a+=10
a-=10   a&=10
复合赋值符
 +=  -=  *=  /=  %=  <<=  >>=  |=  ^=  &=*/  


//单目操作符
//双目操作符
//三目操作符
int main()
{
	int a = 10;
	int b = 20;
	a + b;// + --双目操作符
	return 0;
}
